#+TITLE: LiterateOrg.jl
#+AUTHOR: Stefanos Carlström
#+EMAIL: stefanos.carlstrom@gmail.com

#+PROPERTY: header-args:julia :session *julia-LiterateOrg*

** Simple stack implementation
   #+BEGIN_SRC julia
     struct SimpleStack{T}
         v::Vector{T}
     end

     SimpleStack(T::Type) = SimpleStack(T[])

     import Base: push!, pop!, isempty

     push!(s::SimpleStack{T}, e::T) where T = push!(s.v, e)
     pop!(s::SimpleStack{T}) where T = pop!(s.v)
     isempty(s::SimpleStack{T}) where T = isempty(s.v)
     top(s::SimpleStack{T}) where T = s.v[end]
   #+END_SRC

   #+RESULTS:
   : top (generic function with 1 method)


*** TEST
    This is an unnamed test.

    All code blocks under this heading, regardless of depth, will be
    included in the test suite, unless they belong to COMMENTs or
    EXAMPLEs.

    #+BEGIN_SRC julia
      @test 1 == 1
    #+END_SRC

    #+RESULTS:
    : 7

